tests/perf/lobby-presence.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 60
      arrivalRate: 4
      name: lobby-presence-load
  defaults:
    headers:
      "cache-control": "no-store"
    timeout: 20000
  plugins:
    expect: {}
  ensure:
    - label: lobby presence p95 under 2s
      expression: "p95 < 2000"
    - label: lobby presence median under 1s
      expression: "median < 1000"

scenarios:
  # Spec 070: the lobby list needs a session; the public overview carries the
  # same presence read (player_presence + lobby_counts) for anyone.
  - name: lobby presence snapshot
    flow:
      - get:
          url: "/api/lobby/overview?language=is"
          expect:
            - statusCode: 200