tests/perf/preview-swap.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: preview-swap-load
  defaults:
    headers:
      "content-type": application/json
      "cache-control": "no-store"
    timeout: 20000
  plugins:
    expect: {}
  ensure:
    # Spec 044 SC-011 / plan §Performance Goals — preview RTT p95 < 200ms.
    # Unauthenticated probe: exercises routing, JSON parsing, session read and
    # the early 401 path; the authenticated scan is asserted <50ms server-side
    # by the unit suite (pre-warmed dictionary).
    - label: preview swap median under 200ms
      expression: "median < 200"
    - label: preview swap p95 under 200ms
      expression: "p95 < 200"

scenarios:
  - name: preview swap RTT
    flow:
      - post:
          url: "/api/match/preview"
          json:
            kind: warmup
            board: []
            from: { x: 0, y: 0 }
            to: { x: 1, y: 0 }
          expect:
            - statusCode: 401